---
type: VertexStreamPositionNormal
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 2
tags: [revit-api, class]
---

# VertexStreamPositionNormal

`Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddVertex | 2017 | `public void AddVertex ( VertexPositionNormal vertex )` |
| Method | AddVertices | 2017 | `public void AddVertices ( IList < VertexPositionNormal > vertices )` |